{
  "jokes": ["I went to a street where the houses were numbered 8k, 16k, 32k, 64k, 128k, 256k and 512k. It was a trip down Memory Lane.", "“Debugging” is like being the detective in a crime drama where you are also the murderer.", "The best thing about a Boolean is that even if you are wrong, you are only off by a bit.", "A programmer puts two glasses on his bedside table before going to sleep. A full one, in case he gets thirsty, and an empty one, in case he doesn’t.", "If you listen to a UNIX shell, can you hear the C?", "Why do Java programmers have to wear glasses? Because they don’t C#.", "What sits on your shoulder and says “Pieces of 7! Pieces of 7!”? A Parroty Error.", "When Apple employees die, does their life HTML5 in front of their eyes?", "Without requirements or design, programming is the art of adding bugs to an empty text file.", "Before software can be reusable it first has to be usable.", "The best method for accelerating a computer is the one that boosts it by 9.8 m/s2.", "I think Microsoft named .Net so it wouldn’t show up in a Unix directory listing.", "There are two ways to write error-free programs; only the third one works.", "Why are Russian tanks so happy? Because they don't have depression.", "I'd like to tell a TOG joke, but it's too long.", "How many Pramo members does it take to change a lightbulb? As many of them as it takes for them to finally win a battle.", "What's the best thing about Switzerland? I don't know, but the flag is a big plus.", "I invented a new word! Plagiarism!", "Did you hear about that mathematician who's afraid of numbers? He'll stop at nothing to avoid them."
  ],
  "roasts": [
    "Your quality is so poor I'm obliged to only send one chicken to oppose you.",
    "A Maus on top of a T95 can drive faster and with more power than you can sprint.",
    "I don't even know why did you exist, as your value is more imaginary than the square root of -1.",
    "I'd slap you, but that would be animal abuse.",
    "If I had a dollar for everything smart you've said, I'd have been broke.",
    "I'm not saying I hate you, but if you've been ran over by a tank, I would be the one driving it and drinking tea as if nothing has happened.",
    "I was hoping this battle to be a battle of wits, but it appears that you come unarmed.",
    "Roses are red. Violets are blue. I've got 5 fingers on my right hand. The middle one is for you.",
    "You are my favourite person, except for all the other people I've ever met.",
    "You are so ignorant that you can't see black from white.",
    "You'd be the best trooper in the army, except for all those in the past, present, and the future.",
    "Everyone has the right to be stupid, but you abuse the privilege.",
    "You are so fat that my spotter planes can spot your beer belly rising over the horizon before spotting the Kurfurst right beside you.",
    "Your birth certificate is an apology from the condom factory.",
    "It's ok if you don't agree with me, because I can't force you to be right.",
    "If you're going to be a smartass, first you have to be smart, otherwise you will just be an ass. I don't see any chance of you becoming smart."
  ]
}
